GREETING = "Добро пожаловать в King Simulator!"
PLOT_1 = "После смерти предыдущего короля, трон по праву наследования перешел к Вам."
PLOT_2 = "К сожалению, Вы еще молоды и у Вас нет авторитета и влияния предыдущего короля."
PLOT_3 = "Закончились проводы зимы. Настала пора вернуться к государственным делам."
PLOT_4 = ("Прибыл правитель далекого королевства, пора встретиться с ним. Интересно, что он думают на счет "
          "чайной церемонии.", "Вы ожидали прибытие гостей, но никто не пришел.")
PLOT_5 = ""

GM_DSCRPTN_1 = "Поэтому, чтобы удержать власть Вам необходимо опираться на поддержку ЦЕРКВИ, АРМИИ и НАРОДА."
GM_DSCRPTN_2 = "Так же у Вас есть КАЗНА, из которой Вы можете финансировать различные инициативы."
GM_DSCRPTN_3 = ("Не забывайте, что существуют соседние государства со своими правителями. "
                "Ваши действия и решения могут повлиять на их отношение к Вам")

PRIORITY = "До того как вы примите первые решения в качестве правителя, укажите Ваше имя."

USER = "Пожалуйста, введите имя: "

STATISTIC = ("Имя: {}.\nЦерковь: {}\nАрмия: {}\nЛюди: {}\nКазна: {}")

END = ("Церковь добилась Вашей отставки и последующей публичной казни, посредством сжигания на костре.", "Церковь"
    " добилась Вашей отставки и последущего изгнания. Вам некуда было идти, поэтому Вы отправились в соседнее"
    " государство.")

ARMY_SMMR = ("Ваша армия просит обновление военного инвентаря. Обновить?", "Хотите установить в государстве официальный"
            " военный праздник?", "Построить памятник в честь выдающегося командора?")

CHURCH_SMMR = ("Священник хочет получить в собственность дополнительную землю, чтобы построить ещё несколько церквей. "
               "Дать землю?", "В одном из церковных зданий произошло возгорание. Она просит финансовую помощь "
                "на восстановление. Оказать помощь?")

PEOPLE_SMMR = ("Народ взбунтовался, его не устраивает цены на хлеб. Подавить?", "В оседних странах стало популярным"
            " образование среди черни. Начать строительство школ для крестьян?", "Несколько недель не идёт дождь. "
            "Народ боиться засухи,попросить священника провести молитвенные мероприятия?")

TREASURY_SMMR = ("В вашем государстве завелась крыса, кто-то ворует часть ваших казенных. Разыскать?", "Вы хотите"
                " отправиться отдохнуть в теплый край, организовать маленький отпуск?", "До вас добрался пожар! "
                "Спасти служащих или казенные?")

ARMY_FALL = ("До вас дошли новые технологии. Сформировать новое направление в армии?", "Сын маминой подруги хочет"
            " получить дворянский титул. Подписать соответствующий указ?")

CHURCH_FALL = ("Церковь предложила рисовать иконы с Вами, разрешить их продажу?", "На одну из церквей напали"
                " разбойники и разграбили. Помочь церкви восстановиться? ")

PEOPLE_FALL = ("Создать общественную библиотеку?", )

TREASURY_FALL = ("Хотите отправиться на осенний фестиваль?", "Вы решили жениться. Выбрать жену среду простого люда?")

ARMY_WNTR = ("Начались заморозки. Армии надо утепляться, выделить бюджет?", "Хотите создать стратегическую настольную "
            "игру, чтобы солдаты прокачали навык стратегического мышления?")

CHURCH_WNTR = ("До вас дошли слухи, что церковь начала сжигать красивых девушек, похожих на Вашу бывшую. Подавить?",
            "Церковь во главе с патриархом решила поднять вопрос о Вашей отставке. Задобрить?")

PEOPLE_WNTR = ("Народ взбунтовался, его не устраивают цены на хлеб. Подавить?", "Из-за болезни сдох скот, "
            "начался голод. Помочь подданым?")

TREASURY_WNTR = "Вы чувствуете, что нехватка солнца сказывается на Вас, отправиться на оздоровительные мероприятия?"

ARMY_SPRNG = ("Время подснежников! Ваши войска нашли по их словам настоящий клад! Оставить себе?", "Один из генералов "
            "просит ваше присутствия на предстоящих учениях, чтобы поднять боевой дух солдат. Согласитья?")

CHUCRH_SPRNG = ("Церковь просит сделать официальный церковный праздник. Издать соответствующий указ?","Один из"
                " епископов нарушил закон. Помиловать?")

PEOPLE_SPRNG = ("Народ просит разыскать и публично казгить главаря разбойничей банды, которая орудует на севере"
                " королевства. Согласиться?", "Разведка новых земель принесла первые плоды. Организовать новые пашни?")

TREASURY_SPRNG = ("Хотите отправиться на весенний фестиваль?", "Вы давно не путешествовали. Отправиться в соседнее"
                " госудасрство?")
