GREETING = "Добро пожаловать в King Simulator!"
PLOT_1 = "После смерти предыдущего короля, трон по праву наследования перешел к Вам."
PLOT_2 = "К сожалению, Вы еще молоды и у Вас нет авторитета и влияния предыдущего короля."

GM_DSCRPTN_1 = "Поэтому, чтобы удержать власть Вам необходимо опираться на поддержку ЦЕРКВИ, АРМИИ и НАРОДА."
GM_DSCRPTN_2 = "Так же у Вас есть КАЗНА, из которой Вы можете финансировать различные инициативы."
GM_DSCRPTN_3 = ("Не забывайте, что существуют соседние государства со своими правителями. "
                "Ваши действия и решения могут повлиять на их отношение к Вам")


PRIORITY_1 = "До того как вы примите первые решения в качестве правителя, укажите Ваше имя."
PRIORITY_2 = "Порядок прохождения определяется рандомно."

USER = "Пожалуйста, введите имя: "

STATISTIC = "Имя: {}.\nЦерковь: {}\nАрмия: {}\nЛюди: {}"

QUARTER = "Прошло месяцев: "

MENU_1 = "#1 - Начало"
MENU_2 = "#2 - Показать статистику"
MENU_3 = "#3 - Выход"

END = "Конец, спасибо за игру!"

MNG_EV_SMMR = "[], [], []"
ARMY = ("[Ваша армия просит обновление военного инвентаря. Обновить?], "
        "[Хотите установить в государстве официальный военный праздник?], "
        "[Построить памятник в честь выдающегося командора? ]")

CHURCH = ("[Священник хочет получить в собственность дополнительную землю, чтобы построить ещё несколько церквей. "
          "Дать землю?],"
          "[В одном из церковных зданий произошло возгорание. Она просит финансовую помощь на восстановление. "
          "Оказать помощь?]")

PEOPLE = ("[Народ взбунтовался, его не устраивает цены на хлеб. Подавить?],"
          "[В оседних странах стало популярным образование среди черни. Начать строительство школ для крестьян?],"
          "[Несколько недель не идёт дождь. Народ боиться засухи, "
          "попросить священника провести молитвенные мероприятия?]")

TREASURY = ("[В вашем государстве завелась крыса, кто-то ворует часть ваших казенных. Разыскать?],"
            "[Вы хотите отправиться отдохнуть в теплый край, организовать маленький отпуск?],"
            "[До вас добрался пожар! спасти служащих или казенные?]")

MNG_EV_FALL =

ARMY = ("[До вас дошли новые технологии. Сформировать новое направление в армии?],")

CHURCH = ("[Церковь предложила рисовать иконы с Вами, разрешить их продажу?]")

PEOPLE = ("[Создать общественную библиотеку?]")

TREASURY = ("[Хотите отправиться на осенний фестиваль?]")

MNG_EV_WNTR =

ARMY = ("[Начались заморозки. Армии надо утепляться, выделить бюджет?],"
        "[Хотите создать стратегическую настольную игру, чтобы солдаты прокачали навык стратегического мышления?]")

CHURCH = ("[На одну из церквей напали разбойники и разграбили. Помочь церкви восстановиться? ],"
          "[До вас дошли слухи, что церковь начала сжигать красивых девушек, похожих на Вашу бывшую. Подавить?]")

PEOPLE = ("[Народ взбунтовался, его не устраивают цены на хлеб. Подавить?],"
          "[Из-за болезни сдох скот, начался голод. Помочь подданым?]")

TREASURY = ("[Вы чувствуете, что нехватка солнца сказывается на Вас, отправиться на оздоровительные мероприятия?]")

MNG_EV_SPR =

ARMY = ("[Время подснежников! Ваши войска нашли по их словам настоящий клад! Оставить себе?]")

CHUCRH = ("[Церковь просит сделать официальный церковный праздник. Издать соответствующий указ?]")

PEOPLE = ("[Народ просит найти разбойника и публично казнить. Согласиться?]")

TREASURY = ("[Хотите отправиться на весенний фестиваль?]")

NON_MND_EV = ""




